//Дз1 Урок 1. Настройка среды разработки и первое React-приложение
// 1. Установить node и npm.
// 2. Создать проект и настроить package.json.
// 3. Настроить webpack.config.
// 4. Сделать при помощи webpack сборку простейшего React-кода с использованием функционального компонента сообщения
// 5. Выдать html-файл, в который подключается сборка при помощи webpack-dev-server.
// 6. * Реализовать возможность отправки нового сообщения с фиксированным текстом:
//     добавить кнопку;
//     обрабатывать нажатие на кнопку функцией, которая добавляет в массив сообщений новое — например, с текстом «Нормально».
//     функция-обработчик также должна делать перерендер DOM’а, чтобы новое сообщение не просто добавилось в массив, но и появилось у пользователя на странице. ### Все проблемы и пути их решения подробно обсудим на следующем занятии.

//Дз2 Урок 2. Жизненный цикл React-компонента
// 1. Создать в папке components два компонента: MessageField и Message. Причем компоненты Message должны быть вложены в MessageField.
// 2. Реализовать отправку сообщений по нажатию кнопки.
// 3. На каждое отправленное сообщение должен отвечать робот (используйте componentDidUpdate).
// 4. Добавить автора к сообщениям и отображать его в интерфейсе. Переделать логику ответа от робота в соответствии с этим.
